#09: Membagi Data Frame menjadi dua secara acak

Import Modules

In [1]:
import pandas as pd
import numpy as np

print(pd.__version__)
print(np.__version__)

2.3.3
2.3.4

Persiapan Data Frame

In [2]:

n_rows = 10
n_cols = 5
cols = tuple('ABCDE')

df = pd.DataFrame(np.random.randint(1, 20, size=(n_rows, n_cols)), 
                  columns=cols)
df

    A   B   C   D   E
0  17   8   5  10  15
1  19  11  14  10   7
2  13   6   2   7  19
3   4  13   2   6  14
4  17   7   9   4   8
5   3  18   4  14   1
6   1   4   3   5   5
7   6  15   2  16   7
8  17  10   5   8   1
9  14  17   7  15   4

Membagi Data Frame menjadi dua secara acak berdasarkan proporsi tertentu

In [3]:
df.shape

(10, 5)

In [4]:
proporsi = 0.7
df_1 = df.sample(frac=proporsi)
df_2 = df.drop(df_1.index)

print(f'df_1 shape: {df_1.shape}')
print(f'df_2 shape: {df_2.shape}')

df_1 shape: (7, 5)
df_2 shape: (3, 5)

In [5]:
df_1

    A   B   C   D   E
1  19  11  14  10   7
5   3  18   4  14   1
4  17   7   9   4   8
2  13   6   2   7  19
9  14  17   7  15   4
6   1   4   3   5   5
7   6  15   2  16   7

In [6]:
df_2

    A   B  C   D   E
0  17   8  5  10  15
3   4  13  2   6  14
8  17  10  5   8   1


#10: Mengganti nama (label) kolom pada Data Frame berdasarkan pola

Import Modules

In [7]:

import pandas as pd

print(pd.__version__)

2.3.3

Persiapan Data Frame

In [8]:
df = pd.read_csv('./data/titanicfull.csv')
df.columns = ['Pclass', 'Survival status', 'full Name', 'Sex  ', '  Age', 
              'Sib SP', 'Parch', 'Ticket', 'Fare', 'Cabin', 'Embarked']
df_backup = df.copy(deep=True)

df.head()

,Pclass,Survival status,full Name,Sex,Age,Sib SP,Parch,Ticket,Fare,Cabin,Embarked
0,1,1,"Allen, Miss. Elisabeth Walton",female,29.00,0,0,24160,211.3375,B5,S
1,1,1,"Allison, Master. Hudson Trevor",male,0.92,1,2,113781,151.5500,C22 C26,S
2,1,0,"Allison, Miss. Helen Loraine",female,2.00,1,2,113781,151.5500,C22 C26,S
3,1,0,"Allison, Mr. Hudson Joshua Creighton",male,30.00,1,2,113781,151.5500,C22 C26,S
4,1,0,"Allison, Mrs. Hudson J C (Bessie Waldo Daniels)",female,25.00,1,2,113781,151.5500,C22 C26,S

Menggunakan lowercase untuk nama kolom dan mengganti spasi dengan _

In [9]:

df.columns = df.columns.str.replace(' ', '_').str.lower()
df.head()

,pclass,survival_status,full_name,sex__,__age,sib_sp,parch,ticket,fare,cabin,embarked
0,1,1,"Allen, Miss. Elisabeth Walton",female,29.00,0,0,24160,211.3375,B5,S
1,1,1,"Allison, Master. Hudson Trevor",male,0.92,1,2,113781,151.5500,C22 C26,S
2,1,0,"Allison, Miss. Helen Loraine",female,2.00,1,2,113781,151.5500,C22 C26,S
3,1,0,"Allison, Mr. Hudson Joshua Creighton",male,30.00,1,2,113781,151.5500,C22 C26,S
4,1,0,"Allison, Mrs. Hudson J C (Bessie Waldo Daniels)",female,25.00,1,2,113781,151.5500,C22 C26,S

Memangkas kelebihan spasi pada nama kolom

In [10]:
df = df_backup.copy(deep=True)

df.columns = df.columns.str.lower().str.strip().str.replace(' ', '_')
df.head()

,pclass,survival_status,full_name,sex,age,sib_sp,parch,ticket,fare,cabin,embarked
0,1,1,"Allen, Miss. Elisabeth Walton",female,29.00,0,0,24160,211.3375,B5,S
1,1,1,"Allison, Master. Hudson Trevor",male,0.92,1,2,113781,151.5500,C22 C26,S
2,1,0,"Allison, Miss. Helen Loraine",female,2.00,1,2,113781,151.5500,C22 C26,S
3,1,0,"Allison, Mr. Hudson Joshua Creighton",male,30.00,1,2,113781,151.5500,C22 C26,S
4,1,0,"Allison, Mrs. Hudson J C (Bessie Waldo Daniels)",female,25.00,1,2,113781,151.5500,C22 C26,S


#11: Melakukan seleksi kolom dan baris pada Data Frame menggunakan loc

Import Modules

In [11]:

import pandas as pd
import numpy as np

print(pd.__version__)
print(np.__version__)

2.3.3
2.3.4

Persiapan Data Frame

In [12]:
n_rows = 10
n_cols = 5
cols = tuple('ABCDE')

df = pd.DataFrame(np.random.randint(1, 20, size=(n_rows, n_cols)), 
                  columns=cols)
df

    A   B   C   D   E
0   2  13   4  18  15
1  16   6   7  17  14
2   2   3  15  13   4
3  14   7  18  11   5
4   4  18  11  11  11
5   6  15  16   9  14
6   3   8   2   4  17
7   7   3  13  18   8
8  11  16  10   2  16
9  19   6   4  17   9

Seleksi kolom dan baris menggunakan loc

In [13]:
df.loc[[0,3,4], ['B','E']]

    B   E
0  13  15
3   7   5
4  18  11

Seleksi baris dengan kondisi

In [14]:
df.loc[df['B']>10, ['B','D','E']]

    B   D   E
0  13  18  15
4  18  11  11
5  15   9  14
8  16   2  16

Slicing Data Frame dengan loc

In [15]:
df.loc[0:4, 'B':'D']

    B   C   D
0  13   4  18
1   6   7  17
2   3  15  13
3   7  18  11
4  18  11  11

#12: Membentuk kolom bertipe datetime dari sejumlah kolom lain pada Data Frame

Import Modules

In [16]:
import pandas as pd

print(pd.__version__)

2.3.3

Persiapan Data Frame

In [17]:

data = {'day':[1, 2, 10 ,25, 12], 
        'month':[1, 2, 4, 5, 6], 
        'year':[2000, 2001, 2010, 2015, 2020]}

df = pd.DataFrame(data)
df

   day  month  year
0    1      1  2000
1    2      2  2001
2   10      4  2010
3   25      5  2015
4   12      6  2020

Membentuk kolom bertipe datetime

In [18]:
df['penaggalan'] = pd.to_datetime(df[['day', 'month', 'year']])
df

   day  month  year penaggalan
0    1      1  2000 2000-01-01
1    2      2  2001 2001-02-02
2   10      4  2010 2010-04-10
3   25      5  2015 2015-05-25
4   12      6  2020 2020-06-12

In [19]:
df.dtypes

day                    int64
month                  int64
year                   int64
penaggalan    datetime64[ns]
dtype: object